Функция РазобратьИзСтроки(Знач ВерсияСтрокой, Ошибка, СообщениеОбОшибке) Экспорт
	
	Ошибка = Ложь;
	СообщениеОбОшибке = "";
	
	Если СтрДлина(ВерсияСтрокой) = 0 Тогда
		СообщениеОбОшибке = "Длина строки версии 0";
		Ошибка = Истина;
		Возврат Неопределено; 
	КонецЕсли;

	ВерсияСтрокой = ПодготовитьКЧтению(ВерсияСтрокой);

	МассивСтрокВерсии = СтрРазделить(ВерсияСтрокой, ".");
	
	Если МассивСтрокВерсии.Количество() < 3 Тогда
		СообщениеОбОшибке = "Не найдены все составляющие версии";
		Ошибка = Истина;
		Возврат Неопределено; 
	КонецЕсли;

	СтрокаОсновнаяВерсия = МассивСтрокВерсии[0];

	Если Не ОбнРасшGit_СтроковыеФункции.ТолькоЦифрыВСтроке(СтрокаОсновнаяВерсия) Тогда
		СообщениеОбОшибке = СтрШаблон("Основная версия <%1> должна содержать только цифры",СтрокаОсновнаяВерсия);
		Ошибка = Истина;
		Возврат Неопределено; 
	КонецЕсли;

	Основная = Число(СтрокаОсновнаяВерсия);
	
	СтрокаВторостепеннаяВерсия = МассивСтрокВерсии[1];

	Если Не ОбнРасшGit_СтроковыеФункции.ТолькоЦифрыВСтроке(СтрокаВторостепеннаяВерсия) Тогда
		СообщениеОбОшибке = СтрШаблон("Второстепенная версия <%1> должна содержать только цифры",СтрокаОсновнаяВерсия);
		Ошибка = Истина;
		Возврат Неопределено; 
	КонецЕсли;

	Второстепенная = Число(СтрокаВторостепеннаяВерсия);

	СтрокаПатчаВерсии = МассивСтрокВерсии[2];

	Если Не ОбнРасшGit_СтроковыеФункции.ТолькоЦифрыВСтроке(СтрокаПатчаВерсии) Тогда
		СообщениеОбОшибке = СтрШаблон("Версия патча <%1> должна содержать только цифры",СтрокаОсновнаяВерсия);
		Ошибка = Истина;
		Возврат Неопределено; 
	КонецЕсли;

	Патч = Число(СтрокаПатчаВерсии);
	
	Версия = Новый Массив;
	Версия.Добавить(Основная);
	Версия.Добавить(Второстепенная);
	Версия.Добавить(Патч);
	
	Возврат Версия;
	
КонецФункции

Функция Сравнить(Знач ОсновнаяВерсия, Знач ВерсияДляСравнения) Экспорт
	
	Если НЕ ОсновнаяВерсия[0] = ВерсияДляСравнения[0] Тогда
		Возврат ?(ОсновнаяВерсия[0] > ВерсияДляСравнения[0], 1, -1);
	КонецЕсли;

	Если НЕ ОсновнаяВерсия[1] = ВерсияДляСравнения[1] Тогда
		Возврат ?(ОсновнаяВерсия[1] > ВерсияДляСравнения[1], 1, -1);
	КонецЕсли;
	
	Если НЕ ОсновнаяВерсия[2] = ВерсияДляСравнения[2] Тогда
		Возврат ?(ОсновнаяВерсия[2] > ВерсияДляСравнения[2], 1, -1);
	КонецЕсли;

	Возврат 0;
	
КонецФункции

Функция ПодготовитьКЧтению(Знач СтрокаВерсии)
	
	Если СтрНачинаетсяС(СтрокаВерсии, "v") Тогда
		СтрокаВерсии = СтрЗаменить(СтрокаВерсии, "v", "");
	КонецЕсли;

	МассивСтрокВерсии = СтрРазделить(СтрокаВерсии, ".");

	КоличествоДобавления = 3 - МассивСтрокВерсии.Количество();

	Для ИИ = 1 ПО КоличествоДобавления Цикл
		МассивСтрокВерсии.Добавить(0);
	КонецЦикла;

	Возврат СтрСоединить(МассивСтрокВерсии, ".");

КонецФункции
